app/views/events/popular.html.erb

		<% @results.each_with_index do |result, i| %>
			<% @e = Event.find(result[:event_id]) %>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]