app/controllers/comments_controller.rb

	def index
		if params[:event_id]
			@event = Event.find_by(id: params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

	def show
		if params[:event_id]
			@event = Event.find_by(id: params[:event_id])
			@comment = @event.comments.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."event_id" = ? AND "comments"."id" = ? LIMIT ?  [["event_id", 1], ["id", 8], ["LIMIT", 1]]

	def new
		@comment = Comment.new
		if params[:event_id]
			@event = Event.find_by(id: params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def create
		@comment = Comment.new(comment_params)
		if @comment.save
---
INSERT INTO "comments" ("event_id", "user_id", "note", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["event_id", 4], ["user_id", 2], ["note", "fun"], ["created_at", "2017-06-22 05:22:58.169772"], ["updated_at", "2017-06-22 05:22:58.169772"]]

	def update
		if @comment.update(comment_params)
---
UPDATE "comments" SET "note" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["note", "lets go go go"], ["updated_at", "2017-06-22 16:39:26.723297"], ["id", 1]]

	def destroy
		Comment.delete(@comment)
---
DELETE FROM "comments" WHERE "comments"."id" = 1