app/controllers/event_users_controller.rb

	def create
		event = Event.find(params[:event_user][:event_id])
		if current_user
			@e = Event_User.new(e_params)
			@e.participant_id = current_user.id
			@e.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "event_users" ("event_id", "participant_id", "going", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["event_id", 2], ["participant_id", 2], ["going", "maybe"], ["created_at", "2017-06-22 01:30:34.011543"], ["updated_at", "2017-06-22 01:30:34.011543"]]

	def update
			@e = Event_User.find(params[:id])
			@e.update(e_params)
---
SELECT  "event_users".* FROM "event_users" WHERE "event_users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "event_users" SET "going" = ?, "updated_at" = ? WHERE "event_users"."id" = ?  [["going", "yes"], ["updated_at", "2017-06-22 01:34:08.332328"], ["id", 5]]