app/controllers/events_controller.rb

	def show
		#to display participants & stats of participants
		@event_user = Event_User.find_by(event: @event, participant: current_user)
---
SELECT  "event_users".* FROM "event_users" WHERE "event_users"."event_id" = 1 AND "event_users"."participant_id" IS NULL LIMIT ?  [["LIMIT", 1]]

	def create
		@event = Event.new(event_params)

		if @event.save
---
INSERT INTO "events" ("title", "note", "organizer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Housewarming!"], ["note", "join me!"], ["organizer_id", 2], ["created_at", "2017-06-21 16:03:55.839478"], ["updated_at", "2017-06-21 16:03:55.839478"]]

	def update

		if @event.update(event_params)
---
UPDATE "events" SET "title" = ?, "note" = ?, "location" = ?, "event_time" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "Housewarming update!"], ["note", "updated. come one come all!"], ["location", "New York"], ["event_time", "2017-06-24 00:00:00"], ["updated_at", "2017-06-22 03:07:18.978053"], ["id", 3]]

	def destroy
		Event.delete(@event)
---
DELETE FROM "events" WHERE "events"."id" = 11