app/controllers/itineraries_controller.rb

	def index

		if params[:event_id]
			@event = Event.find_by(id: params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def show
		if params[:event_id]
			@event = Event.find_by(id: params[:event_id])
			@itinerary = @event.itineraries.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "itineraries".* FROM "itineraries" WHERE "itineraries"."event_id" = ? AND "itineraries"."id" = ? LIMIT ?  [["event_id", 1], ["id", 1], ["LIMIT", 1]]

	def new
		@itinerary = Itinerary.new
		if params[:event_id]
			@event = Event.find_by(id: params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		@itinerary = Itinerary.new(itinerary_params)
		if @itinerary.save
---
INSERT INTO "itineraries" ("event_id", "note", "location", "meet_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["event_id", 4], ["note", "speaker 1"], ["location", "flatiron"], ["meet_time", "2017-06-22 20:32:00"], ["created_at", "2017-06-22 22:33:00.272153"], ["updated_at", "2017-06-22 22:33:00.272153"]]

	def update
		if @itinerary.update(itinerary_params)
---
UPDATE "itineraries" SET "location" = ?, "meet_time" = ?, "updated_at" = ? WHERE "itineraries"."id" = ?  [["location", "upstate"], ["meet_time", "2017-06-22 22:21:00"], ["updated_at", "2017-06-22 22:22:38.509182"], ["id", 3]]

	def destroy
		Itinerary.delete(@itinerary)
---
DELETE FROM "itineraries" WHERE "itineraries"."id" = 5

	def set_itinerary
		@itinerary = Itinerary.find(params[:id])
---
SELECT  "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]