app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Hannah"], ["encrypted_password", "$2a$11$QmFpaeMftYgXiekAMSii3OvlAqVgBlwd8last02Tvf9Bj.p.iM8Qy"], ["updated_at", "2017-06-21 17:41:19.906968"], ["id", 2]]
---
	def update
		if @user.update(user_params)